In [1]:
import pandas
pandas.__version__

'1.0.5'

In [2]:
import numpy as np
import pandas as pd

**SERIES**

In [ ]:
serie = pd.Series([55,23,678,453,45,63,937])
serie

0     55
1     23
2    678
3    453
4     45
5     63
6    937
dtype: int64

In [ ]:
serie.values

array([ 55,  23, 678, 453,  45,  63, 937])

In [ ]:
serie.index

RangeIndex(start=0, stop=7, step=1)

In [ ]:
fruits = pd.Series([21, 24, 65, 78], 
    index=['apple','orange','banana','watermelon'])

fruits

apple         21
orange        24
banana        65
watermelon    78
dtype: int64

In [ ]:
fruits['banana']

65

In [ ]:
fruits[3]

78

In [ ]:
fruits.name = 'serie'
fruits.index.name = 'pear'
fruits

pear
apple         21
orange        24
banana        65
watermelon    78
Name: serie, dtype: int64

In [ ]:
np.log(fruits)

pear
apple         3.044522
orange        3.178054
banana        4.174387
watermelon    4.356709
Name: serie, dtype: float64

In [ ]:
fruits[fruits>40]

pear
banana        65
watermelon    78
Name: serie, dtype: int64

In [ ]:
fruits_dict = {'apple': 29, 'orange': 45, 'pear': 34, 'watermelon': 456}
print(fruits_dict)
pd.Series(fruits_dict)

{'apple': 29, 'orange': 45, 'pear': 34, 'watermelon': 456}

apple          29
orange         45
pear           34
watermelon    456
dtype: int64

**DATAFRAME**

In [ ]:
details = {"name": ["Aiden", "Emma", "Reuben", "Akhil", "Ethan"],
        "reg_no": [20, 19, 38, 1, 22],
        "STD": [4, 8, 5, 3, 7]}
print(details)
details = pd.DataFrame(details)
details

{'name': ['Aiden', 'Emma', 'Reuben', 'Akhil', 'Ethan'], 'reg_no': [20, 19, 38, 1, 22], 'STD': [4, 8, 5, 3, 7]}

     name  reg_no  STD
0   Aiden      20    4
1    Emma      19    8
2  Reuben      38    5
3   Akhil       1    3
4   Ethan      22    7

In [ ]:
df = pd.DataFrame(details, columns=["name", "STD" ,"reg_no"])
df

     name  STD  reg_no
0   Aiden    4      20
1    Emma    8      19
2  Reuben    5      38
3   Akhil    3       1
4   Ethan    7      22

In [ ]:
df['nonsense'] = df.reg_no / df.STD
df

     name  STD  reg_no  nonsense
0   Aiden    4      20  5.000000
1    Emma    8      19  2.375000
2  Reuben    5      38  7.600000
3   Akhil    3       1  0.333333
4   Ethan    7      22  3.142857

In [ ]:
df['Serie_aligned'] = pd.Series(range(5), index=[0,1,2, 3, 4])
df

     name  STD  reg_no  nonsense  Serie_aligned
0   Aiden    4      20  5.000000              0
1    Emma    8      19  2.375000              1
2  Reuben    5      38  7.600000              2
3   Akhil    3       1  0.333333              3
4   Ethan    7      22  3.142857              4

In [ ]:
df.to_dict()

{'STD': {0: 4, 1: 8, 2: 5, 3: 3, 4: 7},
 'Serie_aligned': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4},
 'name': {0: 'Aiden', 1: 'Emma', 2: 'Reuben', 3: 'Akhil', 4: 'Ethan'},
 'nonsense': {0: 5.0,
  1: 2.375,
  2: 7.6,
  3: 0.3333333333333333,
  4: 3.142857142857143},
 'reg_no': {0: 20, 1: 19, 2: 38, 3: 1, 4: 22}}

In [ ]:
pd.DataFrame(df.to_dict())

     name  STD  reg_no  nonsense  Serie_aligned
0   Aiden    4      20  5.000000              0
1    Emma    8      19  2.375000              1
2  Reuben    5      38  7.600000              2
3   Akhil    3       1  0.333333              3
4   Ethan    7      22  3.142857              4

In [ ]:
details = [{'a': i, 'b':10* i}for i in range(10)]
print(details)
pd.DataFrame(details)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}, {'a': 6, 'b': 60}, {'a': 7, 'b': 70}, {'a': 8, 'b': 80}, {'a': 9, 'b': 90}]

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50
6  6  60
7  7  70
8  8  80
9  9  90

In [ ]:
pd.DataFrame([{'aa': 1, 'bb': 2}, {'bb': 3, 'cc': 6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [ ]:
pd.DataFrame(np.random.randint(2, 12),
             columns=['abc', 'def'],
             index=['a', 'b', 'c'])

   abc  def
a    5    5
b    5    5
c    5    5

**INDEX OBJECT**

In [ ]:
ind = pd.Index([4,23,678,45,67])
ind

Int64Index([4, 23, 678, 45, 67], dtype='int64')

In [ ]:
ind[1]

23

In [ ]:
ind[4]

67

In [ ]:
ind[::]

Int64Index([4, 23, 678, 45, 67], dtype='int64')

In [ ]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

In [ ]:
#IMMUTABLE BY NORMAL MEANS
ind[1] = 0

TypeError: ignored

**INDEX PRESERVATION**

In [ ]:
rng = np.random.RandomState(15)
ser = pd.Series(rng.randint(4, 45, 3))
ser

0    12
1    16
2     9
dtype: int64

In [ ]:
dfr = pd.DataFrame(rng.randint(0, 10, (5, 4)),
                  columns=['A', 'B', 'C', 'D'])
dfr

   A  B  C  D
0  7  0  7  5
1  6  1  7  0
2  4  9  7  5
3  3  6  8  2
4  1  1  0  5

In [ ]:
np.exp(ser)

0    1.627548e+05
1    8.886111e+06
2    8.103084e+03
dtype: float64

In [ ]:
np.sin(dfr * np.pi / 7)

              A         B             C         D
0  1.224647e-16  0.000000  1.224647e-16  0.781831
1  4.338837e-01  0.433884  1.224647e-16  0.000000
2  9.749279e-01 -0.781831  1.224647e-16  0.781831
3  9.749279e-01  0.433884 -4.338837e-01  0.781831
4  4.338837e-01  0.433884  0.000000e+00  0.781831

**INDEX ALIGNMENT**

In [ ]:
fruits = pd.Series({'Apple': 34, 'orange': 12,
                  'watermelon': 56}, name='fruits')
price = pd.Series({'apple': 45, 'orange': 45,
                        'pear': 78}, name='price')
print(fruits)
price

Apple         34
orange        12
watermelon    56
Name: fruits, dtype: int64

apple     45
orange    45
pear      78
Name: price, dtype: int64

In [ ]:
fruits/price

Apple              NaN
apple              NaN
orange        0.266667
pear               NaN
watermelon         NaN
dtype: float64

In [ ]:
fruits.index | price.index

Index(['Apple', 'apple', 'orange', 'pear', 'watermelon'], dtype='object')

In [ ]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
print(A)
print(B)
B
A + B

0    2
1    4
2    6
dtype: int64
1    1
2    3
3    5
dtype: int64

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [ ]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

**DATA WRANGLING**

In [3]:
df2 = pd.DataFrame({"Province": ["FL", "NH", "ZH"], "name": ["Aiden", "davis", "manjaly"]})
df2

  Province     name
0       FL    Aiden
1       NH    davis
2       ZH  manjaly

    name  STD  reg_no  nonsense  Serie_aligned Province
0  Aiden    4      20       5.0              0       FL

In [5]:
data = {"Province": ["FL", "FL", "NH", "NH", "ZH"],
        "Year": [2013, 2014, 2013, 2014, 2014],
        "Literacy": [0.2, 0.1, 0.5, 0.3, 0.5]}
print(data)
data = pd.DataFrame(data)
data

{'Province': ['FL', 'FL', 'NH', 'NH', 'ZH'], 'Year': [2013, 2014, 2013, 2014, 2014], 'Literacy': [0.2, 0.1, 0.5, 0.3, 0.5]}

  Province  Year  Literacy
0       FL  2013       0.2
1       FL  2014       0.1
2       NH  2013       0.5
3       NH  2014       0.3
4       ZH  2014       0.5

In [6]:
df = pd.DataFrame(data, columns=["Year", "Province" ,"Literacy"])
df

   Year Province  Literacy
0  2013       FL       0.2
1  2014       FL       0.1
2  2013       NH       0.5
3  2014       NH       0.3
4  2014       ZH       0.5

In [7]:
df.merge(df2)

   Year Province  Literacy     name
0  2013       FL       0.2    Aiden
1  2014       FL       0.1    Aiden
2  2013       NH       0.5    davis
3  2014       NH       0.3    davis
4  2014       ZH       0.5  manjaly

In [8]:
df2 = pd.DataFrame({"Province": ["FL", "NH", "ZH"], "Population": ["100000", "200000", "300000"]})
df2

  Province Population
0       FL     100000
1       NH     200000
2       ZH     300000

In [9]:
df.merge(df2)

   Year Province  Literacy Population
0  2013       FL       0.2     100000
1  2014       FL       0.1     100000
2  2013       NH       0.5     200000
3  2014       NH       0.3     200000
4  2014       ZH       0.5     300000

In [11]:
df3 = pd.DataFrame({"province": ["FL", "NH"], "Population": ["100000", "200000"]})
df3
df.merge(df3, right_on='province', left_on='Province')

   Year Province  Literacy province Population
0  2013       FL       0.2       FL     100000
1  2014       FL       0.1       FL     100000
2  2013       NH       0.5       NH     200000
3  2014       NH       0.3       NH     200000

In [12]:
df4 = pd.DataFrame({"Province": ["FL", "NH", "UT"], "Population": ["100000", "200000", "50000"]})
df.merge(df4, how='outer')

     Year Province  Literacy Population
0  2013.0       FL       0.2     100000
1  2014.0       FL       0.1     100000
2  2013.0       NH       0.5     200000
3  2014.0       NH       0.3     200000
4  2014.0       ZH       0.5        NaN
5     NaN       UT       NaN      50000

In [13]:
df5 = pd.DataFrame({"Province": ["FL", "NH", "FL"], "Population": ["100000", "200000", "50000"]})
print(df)
df.merge(df5, how='outer')

   Year Province  Literacy
0  2013       FL       0.2
1  2014       FL       0.1
2  2013       NH       0.5
3  2014       NH       0.3
4  2014       ZH       0.5

   Year Province  Literacy Population
0  2013       FL       0.2     100000
1  2013       FL       0.2      50000
2  2014       FL       0.1     100000
3  2014       FL       0.1      50000
4  2013       NH       0.5     200000
5  2014       NH       0.3     200000
6  2014       ZH       0.5        NaN

In [14]:
df6 = pd.DataFrame({"Province": ["FL", "NH", "FL"], "Population": ["100000", "200000", "50000"]})
print(df)
df.merge(df6, how='inner')

   Year Province  Literacy
0  2013       FL       0.2
1  2014       FL       0.1
2  2013       NH       0.5
3  2014       NH       0.3
4  2014       ZH       0.5

   Year Province  Literacy Population
0  2013       FL       0.2     100000
1  2013       FL       0.2      50000
2  2014       FL       0.1     100000
3  2014       FL       0.1      50000
4  2013       NH       0.5     200000
5  2014       NH       0.3     200000

In [15]:
serie_a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
                     index=['f', 'e', 'd', 'c', 'b', 'a'])
serie_b = pd.Series(np.arange(len(serie_a), dtype=np.float64),
                 index=['f', 'e', 'd', 'c', 'b', 'a'])

In [16]:
serie_a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [17]:
serie_b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [18]:
pd.Series(np.where(pd.isnull(serie_a), serie_b, serie_a), index=serie_a.index)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

In [19]:
serie_a.combine_first(serie_b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64